# CanLoadFamilies Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Family..::..CanLoadFamilies Method
Family Class See Also
---
Checks whether the document is in a state that allows the loading of families.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public static bool CanLoadFamilies(
	Document document
)
```

Visual Basic
---
```text
Public Shared Function CanLoadFamilies ( _
	document As Document _
) As Boolean
```

Visual C++
---
```text
public:
static bool CanLoadFamilies(
	Document^ document
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document to check.
# ### Return Value
True if loading of families is allowed, otherwise False.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Family Class
Autodesk.Revit.DB Namespace